
  #### Terraform Plan Validate All 📖: `success`
  Plan File: `tmp_plan/envs-production.plan`

  <details><summary>Show Plan</summary>

  ```

  
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.env.google_folder.env will be created
  + resource "google_folder" "env" {
      + configured_capabilities = (known after apply)
      + create_time             = (known after apply)
      + deletion_protection     = false
      + display_name            = "fldr-production"
      + folder_id               = (known after apply)
      + id                      = (known after apply)
      + lifecycle_state         = (known after apply)
      + management_project      = (known after apply)
      + name                    = (known after apply)
      + parent                  = "folders/639240509875"
    }

  # module.env.google_tags_tag_binding.folder_env will be created
  + resource "google_tags_tag_binding" "folder_env" {
      + id        = (known after apply)
      + name      = (known after apply)
      + parent    = (known after apply)
      + tag_value = "tagValues/281475445418300"
    }

  # module.env.time_sleep.wait_60_seconds will be created
  + resource "time_sleep" "wait_60_seconds" {
      + destroy_duration = "60s"
      + id               = (known after apply)
    }

  # module.env.module.env_kms.module.budget.data.google_project.project[0] will be read during apply
  # (config refers to values not yet known)
 <= data "google_project" "project" {
      + auto_create_network = (known after apply)
      + billing_account     = (known after apply)
      + deletion_policy     = (known after apply)
      + effective_labels    = (known after apply)
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + labels              = (known after apply)
      + name                = (known after apply)
      + number              = (known after apply)
      + org_id              = (known after apply)
      + project_id          = (known after apply)
      + tags                = (known after apply)
      + terraform_labels    = (known after apply)
    }

  # module.env.module.env_kms.module.budget.google_billing_budget.budget[0] will be created
  + resource "google_billing_budget" "budget" {
      + billing_account = "01C15F-8E2924-09AF0A"
      + display_name    = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)

      + amount {
          + specified_amount {
              + currency_code = (known after apply)
              + units         = "1000"
            }
        }

      + budget_filter {
          + credit_types_treatment = "INCLUDE_ALL_CREDITS"
          + labels                 = (known after apply)
          + projects               = (known after apply)
          + services               = (known after apply)
        }

      + threshold_rules {
          + spend_basis       = "FORECASTED_SPEND"
          + threshold_percent = 1.2
        }
    }

  # module.env.module.env_kms.module.project-factory.google_project.main will be created
  + resource "google_project" "main" {
      + auto_create_network = false
      + billing_account     = "01C15F-8E2924-09AF0A"
      + deletion_policy     = "DELETE"
      + effective_labels    = {
          + "application_name"           = "env-kms"
          + "billing_code"               = "1234"
          + "business_code"              = "shared"
          + "env_code"                   = "p"
          + "environment"                = "production"
          + "goog-terraform-provisioned" = "true"
          + "primary_contact"            = "example1"
          + "secondary_contact"          = "example2"
          + "vpc"                        = "none"
        }
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + labels              = {
          + "application_name"  = "env-kms"
          + "billing_code"      = "1234"
          + "business_code"     = "shared"
          + "env_code"          = "p"
          + "environment"       = "production"
          + "primary_contact"   = "example1"
          + "secondary_contact" = "example2"
          + "vpc"               = "none"
        }
      + name                = "prj-p-kms"
      + number              = (known after apply)
      + org_id              = (known after apply)
      + project_id          = (known after apply)
      + terraform_labels    = {
          + "application_name"           = "env-kms"
          + "billing_code"               = "1234"
          + "business_code"              = "shared"
          + "env_code"                   = "p"
          + "environment"                = "production"
          + "goog-terraform-provisioned" = "true"
          + "primary_contact"            = "example1"
          + "secondary_contact"          = "example2"
          + "vpc"                        = "none"
        }
    }

  # module.env.module.env_kms.module.project-factory.google_project_default_service_accounts.default_service_accounts[0] will be created
  + resource "google_project_default_service_accounts" "default_service_accounts" {
      + action           = "DEPRIVILEGE"
      + id               = (known after apply)
      + project          = (known after apply)
      + restore_policy   = "REVERT_AND_IGNORE_FAILURE"
      + service_accounts = (known after apply)
    }

  # module.env.module.env_kms.module.project-factory.google_service_account.default_service_account[0] will be created
  + resource "google_service_account" "default_service_account" {
      + account_id                   = "project-service-account"
      + create_ignore_already_exists = true
      + disabled                     = false
      + display_name                 = "prj-p-kms Project Service Account"
      + email                        = (known after apply)
      + id                           = (known after apply)
      + member                       = (known after apply)
      + name                         = (known after apply)
      + project                      = (known after apply)
      + unique_id                    = (known after apply)
    }

  # module.env.module.env_kms.module.project-factory.random_id.random_project_id_suffix will be created
  + resource "random_id" "random_project_id_suffix" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 2
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.env.module.env_kms.module.project-factory.random_string.random_project_id_suffix[0] will be created
  + resource "random_string" "random_project_id_suffix" {
      + id          = (known after apply)
      + length      = 4
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.env.module.env_secrets.module.budget.data.google_project.project[0] will be read during apply
  # (config refers to values not yet known)
 <= data "google_project" "project" {
      + auto_create_network = (known after apply)
      + billing_account     = (known after apply)
      + deletion_policy     = (known after apply)
      + effective_labels    = (known after apply)
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + labels              = (known after apply)
      + name                = (known after apply)
      + number              = (known after apply)
      + org_id              = (known after apply)
      + project_id          = (known after apply)
      + tags                = (known after apply)
      + terraform_labels    = (known after apply)
    }

  # module.env.module.env_secrets.module.budget.google_billing_budget.budget[0] will be created
  + resource "google_billing_budget" "budget" {
      + billing_account = "01C15F-8E2924-09AF0A"
      + display_name    = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)

      + amount {
          + specified_amount {
              + currency_code = (known after apply)
              + units         = "1000"
            }
        }

      + budget_filter {
          + credit_types_treatment = "INCLUDE_ALL_CREDITS"
          + labels                 = (known after apply)
          + projects               = (known after apply)
          + services               = (known after apply)
        }

      + threshold_rules {
          + spend_basis       = "FORECASTED_SPEND"
          + threshold_percent = 1.2
        }
    }

  # module.env.module.env_secrets.module.project-factory.google_project.main will be created
  + resource "google_project" "main" {
      + auto_create_network = false
      + billing_account     = "01C15F-8E2924-09AF0A"
      + deletion_policy     = "DELETE"
      + effective_labels    = {
          + "application_name"           = "env-secrets"
          + "billing_code"               = "1234"
          + "business_code"              = "shared"
          + "env_code"                   = "p"
          + "environment"                = "production"
          + "goog-terraform-provisioned" = "true"
          + "primary_contact"            = "example1"
          + "secondary_contact"          = "example2"
          + "vpc"                        = "none"
        }
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + labels              = {
          + "application_name"  = "env-secrets"
          + "billing_code"      = "1234"
          + "business_code"     = "shared"
          + "env_code"          = "p"
          + "environment"       = "production"
          + "primary_contact"   = "example1"
          + "secondary_contact" = "example2"
          + "vpc"               = "none"
        }
      + name                = "prj-p-secrets"
      + number              = (known after apply)
      + org_id              = (known after apply)
      + project_id          = (known after apply)
      + terraform_labels    = {
          + "application_name"           = "env-secrets"
          + "billing_code"               = "1234"
          + "business_code"              = "shared"
          + "env_code"                   = "p"
          + "environment"                = "production"
          + "goog-terraform-provisioned" = "true"
          + "primary_contact"            = "example1"
          + "secondary_contact"          = "example2"
          + "vpc"                        = "none"
        }
    }

  # module.env.module.env_secrets.module.project-factory.google_project_default_service_accounts.default_service_accounts[0] will be created
  + resource "google_project_default_service_accounts" "default_service_accounts" {
      + action           = "DEPRIVILEGE"
      + id               = (known after apply)
      + project          = (known after apply)
      + restore_policy   = "REVERT_AND_IGNORE_FAILURE"
      + service_accounts = (known after apply)
    }

  # module.env.module.env_secrets.module.project-factory.google_service_account.default_service_account[0] will be created
  + resource "google_service_account" "default_service_account" {
      + account_id                   = "project-service-account"
      + create_ignore_already_exists = true
      + disabled                     = false
      + display_name                 = "prj-p-secrets Project Service Account"
      + email                        = (known after apply)
      + id                           = (known after apply)
      + member                       = (known after apply)
      + name                         = (known after apply)
      + project                      = (known after apply)
      + unique_id                    = (known after apply)
    }

  # module.env.module.env_secrets.module.project-factory.random_id.random_project_id_suffix will be created
  + resource "random_id" "random_project_id_suffix" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 2
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.env.module.env_secrets.module.project-factory.random_string.random_project_id_suffix[0] will be created
  + resource "random_string" "random_project_id_suffix" {
      + id          = (known after apply)
      + length      = 4
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.env.module.env_kms.module.project-factory.module.project_services.google_project_service.project_services["billingbudgets.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = (known after apply)
      + service                    = "billingbudgets.googleapis.com"
    }

  # module.env.module.env_kms.module.project-factory.module.project_services.google_project_service.project_services["cloudkms.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = (known after apply)
      + service                    = "cloudkms.googleapis.com"
    }

  # module.env.module.env_kms.module.project-factory.module.project_services.google_project_service.project_services["logging.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = (known after apply)
      + service                    = "logging.googleapis.com"
    }

  # module.env.module.env_secrets.module.project-factory.module.project_services.google_project_service.project_services["logging.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = (known after apply)
      + service                    = "logging.googleapis.com"
    }

  # module.env.module.env_secrets.module.project-factory.module.project_services.google_project_service.project_services["secretmanager.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + project                    = (known after apply)
      + service                    = "secretmanager.googleapis.com"
    }

Plan: 20 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + assured_workload_id        = ""
  + assured_workload_resources = []
  + env_folder                 = (known after apply)
  + env_kms_project_id         = (known after apply)
  + env_kms_project_number     = (known after apply)
  + env_secrets_project_id     = (known after apply)

  ```

  </details>
  
  